-- --------------------------------------------------------
-- Сервер:                       127.0.0.1
-- Версія сервера:               5.7.29-log - MySQL Community Server (GPL)
-- ОС сервера:                   Win64
-- HeidiSQL Версія:              11.0.0.5919
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;

-- Dumping structure for таблиця l2jgs.communitybuff
DROP TABLE IF EXISTS `communitybuff`;
CREATE TABLE IF NOT EXISTS `communitybuff` (
  `key` int(11) DEFAULT NULL,
  `skillID` int(11) DEFAULT NULL,
  `buff_id` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- Dumping data for table l2jgs.communitybuff: ~106 rows (приблизно)
/*!40000 ALTER TABLE `communitybuff` DISABLE KEYS */;
INSERT INTO `communitybuff` (`key`, `skillID`, `buff_id`) VALUES
	(1, 1077, 1),
	(2, 1242, 1),
	(3, 1086, 1),
	(4, 1240, 1),
	(5, 1045, 3),
	(6, 1048, 3),
	(7, 1087, 1),
	(8, 1257, 3),
	(9, 1068, 1),
	(10, 1040, 3),
	(11, 1036, 3),
	(12, 1268, 1),
	(13, 1204, 3),
	(14, 1062, 3),
	(15, 1388, 1),
	(16, 1397, 3),
	(17, 1085, 2),
	(18, 1059, 2),
	(19, 1389, 2),
	(20, 1303, 2),
	(21, 264, 6),
	(22, 265, 6),
	(23, 267, 6),
	(24, 268, 6),
	(25, 269, 4),
	(26, 271, 4),
	(27, 274, 4),
	(28, 275, 4),
	(29, 304, 6),
	(30, 310, 4),
	(31, 349, 6),
	(32, 364, 4),
	(33, 273, 5),
	(34, 276, 5),
	(35, 363, 5),
	(36, 1413, 3),
	(37, 365, 5),
	(38, 1363, 1),
	(39, 1035, 0),
	(40, 1043, 0),
	(41, 1044, 0),
	(42, 1073, 0),
	(43, 1078, 0),
	(44, 1032, 0),
	(45, 1243, 0),
	(46, 1460, 0),
	(47, 1259, 0),
	(48, 1304, 0),
	(49, 1353, 0),
	(50, 1354, 0),
	(51, 1355, 0),
	(52, 1357, 0),
	(53, 1356, 0),
	(54, 1191, 0),
	(55, 1033, 0),
	(56, 1182, 0),
	(57, 1189, 0),
	(58, 1392, 0),
	(59, 1393, 0),
	(60, 1352, 0),
	(61, 272, 0),
	(62, 277, 0),
	(63, 307, 0),
	(64, 309, 0),
	(65, 311, 0),
	(66, 366, 0),
	(67, 530, 0),
	(68, 266, 0),
	(69, 270, 0),
	(70, 305, 0),
	(71, 306, 0),
	(72, 308, 0),
	(73, 529, 0),
	(74, 1007, 0),
	(75, 1009, 0),
	(76, 1002, 0),
	(77, 1006, 0),
	(78, 1251, 0),
	(79, 1252, 0),
	(80, 1253, 0),
	(81, 1284, 0),
	(82, 1308, 0),
	(83, 1309, 0),
	(84, 1310, 0),
	(85, 1362, 0),
	(86, 1390, 0),
	(87, 1391, 0),
	(88, 1461, 0),
	(89, 1003, 0),
	(90, 1004, 0),
	(91, 1005, 0),
	(92, 1008, 0),
	(93, 1249, 0),
	(94, 1250, 0),
	(95, 1260, 0),
	(96, 1261, 0),
	(97, 1282, 0),
	(98, 1364, 0),
	(99, 1365, 0),
	(100, 1414, 0),
	(101, 1415, 0),
	(102, 1416, 0),
	(103, 4699, 0),
	(104, 4700, 0),
	(105, 4702, 0),
	(106, 4703, 0);
/*!40000 ALTER TABLE `communitybuff` ENABLE KEYS */;

/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IF(@OLD_FOREIGN_KEY_CHECKS IS NULL, 1, @OLD_FOREIGN_KEY_CHECKS) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
